{
  "offsets": {
    "SPECIAL": 0,
    "PATCH_ID": 5,
    "TIMEFRAME_ID": 261,
    "TABLE_ID": 263,
    "REGIME_FLAG_ID": 265,
    "ASSET_ID": 275,
    "BIN_RET": 1275,
    "BIN_RVOL": 1534,
    "BIN_VLM": 1665,
    "BIN_FLOW": 1796,
    "BIN_SPREAD": 1927,
    "BIN_OI": 2026,
    "BIN_FUND": 2157,
    "BIN_BASIS": 2288,
    "EVENT_TYPE": 2419,
    "EVENT_DIR": 2434,
    "EVENT_MAG": 2438,
    "EVENT_DUR": 2443,
    "EVENT_CONF": 2448,
    "EVENT_SURP": 2452,
    "EVENT_SRC": 2456
  },
  "mapping": {
    "<S>": 0,
    "</S>": 1,
    "<A>": 2,
    "</A>": 3,
    "<Q>": 4,
    "PATCH_0": 5,
    "PATCH_1": 6,
    "PATCH_2": 7,
    "PATCH_3": 8,
    "PATCH_4": 9,
    "PATCH_5": 10,
    "PATCH_6": 11,
    "PATCH_7": 12,
    "PATCH_8": 13,
    "PATCH_9": 14,
    "PATCH_10": 15,
    "PATCH_11": 16,
    "PATCH_12": 17,
    "PATCH_13": 18,
    "PATCH_14": 19,
    "PATCH_15": 20,
    "PATCH_16": 21,
    "PATCH_17": 22,
    "PATCH_18": 23,
    "PATCH_19": 24,
    "PATCH_20": 25,
    "PATCH_21": 26,
    "PATCH_22": 27,
    "PATCH_23": 28,
    "PATCH_24": 29,
    "PATCH_25": 30,
    "PATCH_26": 31,
    "PATCH_27": 32,
    "PATCH_28": 33,
    "PATCH_29": 34,
    "PATCH_30": 35,
    "PATCH_31": 36,
    "PATCH_32": 37,
    "PATCH_33": 38,
    "PATCH_34": 39,
    "PATCH_35": 40,
    "PATCH_36": 41,
    "PATCH_37": 42,
    "PATCH_38": 43,
    "PATCH_39": 44,
    "PATCH_40": 45,
    "PATCH_41": 46,
    "PATCH_42": 47,
    "PATCH_43": 48,
    "PATCH_44": 49,
    "PATCH_45": 50,
    "PATCH_46": 51,
    "PATCH_47": 52,
    "PATCH_48": 53,
    "PATCH_49": 54,
    "PATCH_50": 55,
    "PATCH_51": 56,
    "PATCH_52": 57,
    "PATCH_53": 58,
    "PATCH_54": 59,
    "PATCH_55": 60,
    "PATCH_56": 61,
    "PATCH_57": 62,
    "PATCH_58": 63,
    "PATCH_59": 64,
    "PATCH_60": 65,
    "PATCH_61": 66,
    "PATCH_62": 67,
    "PATCH_63": 68,
    "PATCH_64": 69,
    "PATCH_65": 70,
    "PATCH_66": 71,
    "PATCH_67": 72,
    "PATCH_68": 73,
    "PATCH_69": 74,
    "PATCH_70": 75,
    "PATCH_71": 76,
    "PATCH_72": 77,
    "PATCH_73": 78,
    "PATCH_74": 79,
    "PATCH_75": 80,
    "PATCH_76": 81,
    "PATCH_77": 82,
    "PATCH_78": 83,
    "PATCH_79": 84,
    "PATCH_80": 85,
    "PATCH_81": 86,
    "PATCH_82": 87,
    "PATCH_83": 88,
    "PATCH_84": 89,
    "PATCH_85": 90,
    "PATCH_86": 91,
    "PATCH_87": 92,
    "PATCH_88": 93,
    "PATCH_89": 94,
    "PATCH_90": 95,
    "PATCH_91": 96,
    "PATCH_92": 97,
    "PATCH_93": 98,
    "PATCH_94": 99,
    "PATCH_95": 100,
    "PATCH_96": 101,
    "PATCH_97": 102,
    "PATCH_98": 103,
    "PATCH_99": 104,
    "PATCH_100": 105,
    "PATCH_101": 106,
    "PATCH_102": 107,
    "PATCH_103": 108,
    "PATCH_104": 109,
    "PATCH_105": 110,
    "PATCH_106": 111,
    "PATCH_107": 112,
    "PATCH_108": 113,
    "PATCH_109": 114,
    "PATCH_110": 115,
    "PATCH_111": 116,
    "PATCH_112": 117,
    "PATCH_113": 118,
    "PATCH_114": 119,
    "PATCH_115": 120,
    "PATCH_116": 121,
    "PATCH_117": 122,
    "PATCH_118": 123,
    "PATCH_119": 124,
    "PATCH_120": 125,
    "PATCH_121": 126,
    "PATCH_122": 127,
    "PATCH_123": 128,
    "PATCH_124": 129,
    "PATCH_125": 130,
    "PATCH_126": 131,
    "PATCH_127": 132,
    "PATCH_128": 133,
    "PATCH_129": 134,
    "PATCH_130": 135,
    "PATCH_131": 136,
    "PATCH_132": 137,
    "PATCH_133": 138,
    "PATCH_134": 139,
    "PATCH_135": 140,
    "PATCH_136": 141,
    "PATCH_137": 142,
    "PATCH_138": 143,
    "PATCH_139": 144,
    "PATCH_140": 145,
    "PATCH_141": 146,
    "PATCH_142": 147,
    "PATCH_143": 148,
    "PATCH_144": 149,
    "PATCH_145": 150,
    "PATCH_146": 151,
    "PATCH_147": 152,
    "PATCH_148": 153,
    "PATCH_149": 154,
    "PATCH_150": 155,
    "PATCH_151": 156,
    "PATCH_152": 157,
    "PATCH_153": 158,
    "PATCH_154": 159,
    "PATCH_155": 160,
    "PATCH_156": 161,
    "PATCH_157": 162,
    "PATCH_158": 163,
    "PATCH_159": 164,
    "PATCH_160": 165,
    "PATCH_161": 166,
    "PATCH_162": 167,
    "PATCH_163": 168,
    "PATCH_164": 169,
    "PATCH_165": 170,
    "PATCH_166": 171,
    "PATCH_167": 172,
    "PATCH_168": 173,
    "PATCH_169": 174,
    "PATCH_170": 175,
    "PATCH_171": 176,
    "PATCH_172": 177,
    "PATCH_173": 178,
    "PATCH_174": 179,
    "PATCH_175": 180,
    "PATCH_176": 181,
    "PATCH_177": 182,
    "PATCH_178": 183,
    "PATCH_179": 184,
    "PATCH_180": 185,
    "PATCH_181": 186,
    "PATCH_182": 187,
    "PATCH_183": 188,
    "PATCH_184": 189,
    "PATCH_185": 190,
    "PATCH_186": 191,
    "PATCH_187": 192,
    "PATCH_188": 193,
    "PATCH_189": 194,
    "PATCH_190": 195,
    "PATCH_191": 196,
    "PATCH_192": 197,
    "PATCH_193": 198,
    "PATCH_194": 199,
    "PATCH_195": 200,
    "PATCH_196": 201,
    "PATCH_197": 202,
    "PATCH_198": 203,
    "PATCH_199": 204,
    "PATCH_200": 205,
    "PATCH_201": 206,
    "PATCH_202": 207,
    "PATCH_203": 208,
    "PATCH_204": 209,
    "PATCH_205": 210,
    "PATCH_206": 211,
    "PATCH_207": 212,
    "PATCH_208": 213,
    "PATCH_209": 214,
    "PATCH_210": 215,
    "PATCH_211": 216,
    "PATCH_212": 217,
    "PATCH_213": 218,
    "PATCH_214": 219,
    "PATCH_215": 220,
    "PATCH_216": 221,
    "PATCH_217": 222,
    "PATCH_218": 223,
    "PATCH_219": 224,
    "PATCH_220": 225,
    "PATCH_221": 226,
    "PATCH_222": 227,
    "PATCH_223": 228,
    "PATCH_224": 229,
    "PATCH_225": 230,
    "PATCH_226": 231,
    "PATCH_227": 232,
    "PATCH_228": 233,
    "PATCH_229": 234,
    "PATCH_230": 235,
    "PATCH_231": 236,
    "PATCH_232": 237,
    "PATCH_233": 238,
    "PATCH_234": 239,
    "PATCH_235": 240,
    "PATCH_236": 241,
    "PATCH_237": 242,
    "PATCH_238": 243,
    "PATCH_239": 244,
    "PATCH_240": 245,
    "PATCH_241": 246,
    "PATCH_242": 247,
    "PATCH_243": 248,
    "PATCH_244": 249,
    "PATCH_245": 250,
    "PATCH_246": 251,
    "PATCH_247": 252,
    "PATCH_248": 253,
    "PATCH_249": 254,
    "PATCH_250": 255,
    "PATCH_251": 256,
    "PATCH_252": 257,
    "PATCH_253": 258,
    "PATCH_254": 259,
    "PATCH_255": 260,
    "RET_BIN_0": 1275,
    "RET_BIN_1": 1276,
    "RET_BIN_2": 1277,
    "RET_BIN_3": 1278,
    "RET_BIN_4": 1279,
    "RET_BIN_5": 1280,
    "RET_BIN_6": 1281,
    "RET_BIN_7": 1282,
    "RET_BIN_8": 1283,
    "RET_BIN_9": 1284,
    "RET_BIN_10": 1285,
    "RET_BIN_11": 1286,
    "RET_BIN_12": 1287,
    "RET_BIN_13": 1288,
    "RET_BIN_14": 1289,
    "RET_BIN_15": 1290,
    "RET_BIN_16": 1291,
    "RET_BIN_17": 1292,
    "RET_BIN_18": 1293,
    "RET_BIN_19": 1294,
    "RET_BIN_20": 1295,
    "RET_BIN_21": 1296,
    "RET_BIN_22": 1297,
    "RET_BIN_23": 1298,
    "RET_BIN_24": 1299,
    "RET_BIN_25": 1300,
    "RET_BIN_26": 1301,
    "RET_BIN_27": 1302,
    "RET_BIN_28": 1303,
    "RET_BIN_29": 1304,
    "RET_BIN_30": 1305,
    "RET_BIN_31": 1306,
    "RET_BIN_32": 1307,
    "RET_BIN_33": 1308,
    "RET_BIN_34": 1309,
    "RET_BIN_35": 1310,
    "RET_BIN_36": 1311,
    "RET_BIN_37": 1312,
    "RET_BIN_38": 1313,
    "RET_BIN_39": 1314,
    "RET_BIN_40": 1315,
    "RET_BIN_41": 1316,
    "RET_BIN_42": 1317,
    "RET_BIN_43": 1318,
    "RET_BIN_44": 1319,
    "RET_BIN_45": 1320,
    "RET_BIN_46": 1321,
    "RET_BIN_47": 1322,
    "RET_BIN_48": 1323,
    "RET_BIN_49": 1324,
    "RET_BIN_50": 1325,
    "RET_BIN_51": 1326,
    "RET_BIN_52": 1327,
    "RET_BIN_53": 1328,
    "RET_BIN_54": 1329,
    "RET_BIN_55": 1330,
    "RET_BIN_56": 1331,
    "RET_BIN_57": 1332,
    "RET_BIN_58": 1333,
    "RET_BIN_59": 1334,
    "RET_BIN_60": 1335,
    "RET_BIN_61": 1336,
    "RET_BIN_62": 1337,
    "RET_BIN_63": 1338,
    "RET_BIN_64": 1339,
    "RET_BIN_65": 1340,
    "RET_BIN_66": 1341,
    "RET_BIN_67": 1342,
    "RET_BIN_68": 1343,
    "RET_BIN_69": 1344,
    "RET_BIN_70": 1345,
    "RET_BIN_71": 1346,
    "RET_BIN_72": 1347,
    "RET_BIN_73": 1348,
    "RET_BIN_74": 1349,
    "RET_BIN_75": 1350,
    "RET_BIN_76": 1351,
    "RET_BIN_77": 1352,
    "RET_BIN_78": 1353,
    "RET_BIN_79": 1354,
    "RET_BIN_80": 1355,
    "RET_BIN_81": 1356,
    "RET_BIN_82": 1357,
    "RET_BIN_83": 1358,
    "RET_BIN_84": 1359,
    "RET_BIN_85": 1360,
    "RET_BIN_86": 1361,
    "RET_BIN_87": 1362,
    "RET_BIN_88": 1363,
    "RET_BIN_89": 1364,
    "RET_BIN_90": 1365,
    "RET_BIN_91": 1366,
    "RET_BIN_92": 1367,
    "RET_BIN_93": 1368,
    "RET_BIN_94": 1369,
    "RET_BIN_95": 1370,
    "RET_BIN_96": 1371,
    "RET_BIN_97": 1372,
    "RET_BIN_98": 1373,
    "RET_BIN_99": 1374,
    "RET_BIN_100": 1375,
    "RET_BIN_101": 1376,
    "RET_BIN_102": 1377,
    "RET_BIN_103": 1378,
    "RET_BIN_104": 1379,
    "RET_BIN_105": 1380,
    "RET_BIN_106": 1381,
    "RET_BIN_107": 1382,
    "RET_BIN_108": 1383,
    "RET_BIN_109": 1384,
    "RET_BIN_110": 1385,
    "RET_BIN_111": 1386,
    "RET_BIN_112": 1387,
    "RET_BIN_113": 1388,
    "RET_BIN_114": 1389,
    "RET_BIN_115": 1390,
    "RET_BIN_116": 1391,
    "RET_BIN_117": 1392,
    "RET_BIN_118": 1393,
    "RET_BIN_119": 1394,
    "RET_BIN_120": 1395,
    "RET_BIN_121": 1396,
    "RET_BIN_122": 1397,
    "RET_BIN_123": 1398,
    "RET_BIN_124": 1399,
    "RET_BIN_125": 1400,
    "RET_BIN_126": 1401,
    "RET_BIN_127": 1402,
    "RET_BIN_128": 1403,
    "RET_BIN_129": 1404,
    "RET_BIN_130": 1405,
    "RET_BIN_131": 1406,
    "RET_BIN_132": 1407,
    "RET_BIN_133": 1408,
    "RET_BIN_134": 1409,
    "RET_BIN_135": 1410,
    "RET_BIN_136": 1411,
    "RET_BIN_137": 1412,
    "RET_BIN_138": 1413,
    "RET_BIN_139": 1414,
    "RET_BIN_140": 1415,
    "RET_BIN_141": 1416,
    "RET_BIN_142": 1417,
    "RET_BIN_143": 1418,
    "RET_BIN_144": 1419,
    "RET_BIN_145": 1420,
    "RET_BIN_146": 1421,
    "RET_BIN_147": 1422,
    "RET_BIN_148": 1423,
    "RET_BIN_149": 1424,
    "RET_BIN_150": 1425,
    "RET_BIN_151": 1426,
    "RET_BIN_152": 1427,
    "RET_BIN_153": 1428,
    "RET_BIN_154": 1429,
    "RET_BIN_155": 1430,
    "RET_BIN_156": 1431,
    "RET_BIN_157": 1432,
    "RET_BIN_158": 1433,
    "RET_BIN_159": 1434,
    "RET_BIN_160": 1435,
    "RET_BIN_161": 1436,
    "RET_BIN_162": 1437,
    "RET_BIN_163": 1438,
    "RET_BIN_164": 1439,
    "RET_BIN_165": 1440,
    "RET_BIN_166": 1441,
    "RET_BIN_167": 1442,
    "RET_BIN_168": 1443,
    "RET_BIN_169": 1444,
    "RET_BIN_170": 1445,
    "RET_BIN_171": 1446,
    "RET_BIN_172": 1447,
    "RET_BIN_173": 1448,
    "RET_BIN_174": 1449,
    "RET_BIN_175": 1450,
    "RET_BIN_176": 1451,
    "RET_BIN_177": 1452,
    "RET_BIN_178": 1453,
    "RET_BIN_179": 1454,
    "RET_BIN_180": 1455,
    "RET_BIN_181": 1456,
    "RET_BIN_182": 1457,
    "RET_BIN_183": 1458,
    "RET_BIN_184": 1459,
    "RET_BIN_185": 1460,
    "RET_BIN_186": 1461,
    "RET_BIN_187": 1462,
    "RET_BIN_188": 1463,
    "RET_BIN_189": 1464,
    "RET_BIN_190": 1465,
    "RET_BIN_191": 1466,
    "RET_BIN_192": 1467,
    "RET_BIN_193": 1468,
    "RET_BIN_194": 1469,
    "RET_BIN_195": 1470,
    "RET_BIN_196": 1471,
    "RET_BIN_197": 1472,
    "RET_BIN_198": 1473,
    "RET_BIN_199": 1474,
    "RET_BIN_200": 1475,
    "RET_BIN_201": 1476,
    "RET_BIN_202": 1477,
    "RET_BIN_203": 1478,
    "RET_BIN_204": 1479,
    "RET_BIN_205": 1480,
    "RET_BIN_206": 1481,
    "RET_BIN_207": 1482,
    "RET_BIN_208": 1483,
    "RET_BIN_209": 1484,
    "RET_BIN_210": 1485,
    "RET_BIN_211": 1486,
    "RET_BIN_212": 1487,
    "RET_BIN_213": 1488,
    "RET_BIN_214": 1489,
    "RET_BIN_215": 1490,
    "RET_BIN_216": 1491,
    "RET_BIN_217": 1492,
    "RET_BIN_218": 1493,
    "RET_BIN_219": 1494,
    "RET_BIN_220": 1495,
    "RET_BIN_221": 1496,
    "RET_BIN_222": 1497,
    "RET_BIN_223": 1498,
    "RET_BIN_224": 1499,
    "RET_BIN_225": 1500,
    "RET_BIN_226": 1501,
    "RET_BIN_227": 1502,
    "RET_BIN_228": 1503,
    "RET_BIN_229": 1504,
    "RET_BIN_230": 1505,
    "RET_BIN_231": 1506,
    "RET_BIN_232": 1507,
    "RET_BIN_233": 1508,
    "RET_BIN_234": 1509,
    "RET_BIN_235": 1510,
    "RET_BIN_236": 1511,
    "RET_BIN_237": 1512,
    "RET_BIN_238": 1513,
    "RET_BIN_239": 1514,
    "RET_BIN_240": 1515,
    "RET_BIN_241": 1516,
    "RET_BIN_242": 1517,
    "RET_BIN_243": 1518,
    "RET_BIN_244": 1519,
    "RET_BIN_245": 1520,
    "RET_BIN_246": 1521,
    "RET_BIN_247": 1522,
    "RET_BIN_248": 1523,
    "RET_BIN_249": 1524,
    "RET_BIN_250": 1525,
    "RET_BIN_251": 1526,
    "RET_BIN_252": 1527,
    "RET_BIN_253": 1528,
    "RET_BIN_254": 1529,
    "RET_BIN_255": 1530,
    "RET_MISS": 1531,
    "RET_OOR_LOW": 1532,
    "RET_OOR_HIGH": 1533,
    "RVOL_BIN_0": 1534,
    "RVOL_BIN_1": 1535,
    "RVOL_BIN_2": 1536,
    "RVOL_BIN_3": 1537,
    "RVOL_BIN_4": 1538,
    "RVOL_BIN_5": 1539,
    "RVOL_BIN_6": 1540,
    "RVOL_BIN_7": 1541,
    "RVOL_BIN_8": 1542,
    "RVOL_BIN_9": 1543,
    "RVOL_BIN_10": 1544,
    "RVOL_BIN_11": 1545,
    "RVOL_BIN_12": 1546,
    "RVOL_BIN_13": 1547,
    "RVOL_BIN_14": 1548,
    "RVOL_BIN_15": 1549,
    "RVOL_BIN_16": 1550,
    "RVOL_BIN_17": 1551,
    "RVOL_BIN_18": 1552,
    "RVOL_BIN_19": 1553,
    "RVOL_BIN_20": 1554,
    "RVOL_BIN_21": 1555,
    "RVOL_BIN_22": 1556,
    "RVOL_BIN_23": 1557,
    "RVOL_BIN_24": 1558,
    "RVOL_BIN_25": 1559,
    "RVOL_BIN_26": 1560,
    "RVOL_BIN_27": 1561,
    "RVOL_BIN_28": 1562,
    "RVOL_BIN_29": 1563,
    "RVOL_BIN_30": 1564,
    "RVOL_BIN_31": 1565,
    "RVOL_BIN_32": 1566,
    "RVOL_BIN_33": 1567,
    "RVOL_BIN_34": 1568,
    "RVOL_BIN_35": 1569,
    "RVOL_BIN_36": 1570,
    "RVOL_BIN_37": 1571,
    "RVOL_BIN_38": 1572,
    "RVOL_BIN_39": 1573,
    "RVOL_BIN_40": 1574,
    "RVOL_BIN_41": 1575,
    "RVOL_BIN_42": 1576,
    "RVOL_BIN_43": 1577,
    "RVOL_BIN_44": 1578,
    "RVOL_BIN_45": 1579,
    "RVOL_BIN_46": 1580,
    "RVOL_BIN_47": 1581,
    "RVOL_BIN_48": 1582,
    "RVOL_BIN_49": 1583,
    "RVOL_BIN_50": 1584,
    "RVOL_BIN_51": 1585,
    "RVOL_BIN_52": 1586,
    "RVOL_BIN_53": 1587,
    "RVOL_BIN_54": 1588,
    "RVOL_BIN_55": 1589,
    "RVOL_BIN_56": 1590,
    "RVOL_BIN_57": 1591,
    "RVOL_BIN_58": 1592,
    "RVOL_BIN_59": 1593,
    "RVOL_BIN_60": 1594,
    "RVOL_BIN_61": 1595,
    "RVOL_BIN_62": 1596,
    "RVOL_BIN_63": 1597,
    "RVOL_BIN_64": 1598,
    "RVOL_BIN_65": 1599,
    "RVOL_BIN_66": 1600,
    "RVOL_BIN_67": 1601,
    "RVOL_BIN_68": 1602,
    "RVOL_BIN_69": 1603,
    "RVOL_BIN_70": 1604,
    "RVOL_BIN_71": 1605,
    "RVOL_BIN_72": 1606,
    "RVOL_BIN_73": 1607,
    "RVOL_BIN_74": 1608,
    "RVOL_BIN_75": 1609,
    "RVOL_BIN_76": 1610,
    "RVOL_BIN_77": 1611,
    "RVOL_BIN_78": 1612,
    "RVOL_BIN_79": 1613,
    "RVOL_BIN_80": 1614,
    "RVOL_BIN_81": 1615,
    "RVOL_BIN_82": 1616,
    "RVOL_BIN_83": 1617,
    "RVOL_BIN_84": 1618,
    "RVOL_BIN_85": 1619,
    "RVOL_BIN_86": 1620,
    "RVOL_BIN_87": 1621,
    "RVOL_BIN_88": 1622,
    "RVOL_BIN_89": 1623,
    "RVOL_BIN_90": 1624,
    "RVOL_BIN_91": 1625,
    "RVOL_BIN_92": 1626,
    "RVOL_BIN_93": 1627,
    "RVOL_BIN_94": 1628,
    "RVOL_BIN_95": 1629,
    "RVOL_BIN_96": 1630,
    "RVOL_BIN_97": 1631,
    "RVOL_BIN_98": 1632,
    "RVOL_BIN_99": 1633,
    "RVOL_BIN_100": 1634,
    "RVOL_BIN_101": 1635,
    "RVOL_BIN_102": 1636,
    "RVOL_BIN_103": 1637,
    "RVOL_BIN_104": 1638,
    "RVOL_BIN_105": 1639,
    "RVOL_BIN_106": 1640,
    "RVOL_BIN_107": 1641,
    "RVOL_BIN_108": 1642,
    "RVOL_BIN_109": 1643,
    "RVOL_BIN_110": 1644,
    "RVOL_BIN_111": 1645,
    "RVOL_BIN_112": 1646,
    "RVOL_BIN_113": 1647,
    "RVOL_BIN_114": 1648,
    "RVOL_BIN_115": 1649,
    "RVOL_BIN_116": 1650,
    "RVOL_BIN_117": 1651,
    "RVOL_BIN_118": 1652,
    "RVOL_BIN_119": 1653,
    "RVOL_BIN_120": 1654,
    "RVOL_BIN_121": 1655,
    "RVOL_BIN_122": 1656,
    "RVOL_BIN_123": 1657,
    "RVOL_BIN_124": 1658,
    "RVOL_BIN_125": 1659,
    "RVOL_BIN_126": 1660,
    "RVOL_BIN_127": 1661,
    "RVOL_MISS": 1662,
    "RVOL_OOR_LOW": 1663,
    "RVOL_OOR_HIGH": 1664,
    "VLM_BIN_0": 1665,
    "VLM_BIN_1": 1666,
    "VLM_BIN_2": 1667,
    "VLM_BIN_3": 1668,
    "VLM_BIN_4": 1669,
    "VLM_BIN_5": 1670,
    "VLM_BIN_6": 1671,
    "VLM_BIN_7": 1672,
    "VLM_BIN_8": 1673,
    "VLM_BIN_9": 1674,
    "VLM_BIN_10": 1675,
    "VLM_BIN_11": 1676,
    "VLM_BIN_12": 1677,
    "VLM_BIN_13": 1678,
    "VLM_BIN_14": 1679,
    "VLM_BIN_15": 1680,
    "VLM_BIN_16": 1681,
    "VLM_BIN_17": 1682,
    "VLM_BIN_18": 1683,
    "VLM_BIN_19": 1684,
    "VLM_BIN_20": 1685,
    "VLM_BIN_21": 1686,
    "VLM_BIN_22": 1687,
    "VLM_BIN_23": 1688,
    "VLM_BIN_24": 1689,
    "VLM_BIN_25": 1690,
    "VLM_BIN_26": 1691,
    "VLM_BIN_27": 1692,
    "VLM_BIN_28": 1693,
    "VLM_BIN_29": 1694,
    "VLM_BIN_30": 1695,
    "VLM_BIN_31": 1696,
    "VLM_BIN_32": 1697,
    "VLM_BIN_33": 1698,
    "VLM_BIN_34": 1699,
    "VLM_BIN_35": 1700,
    "VLM_BIN_36": 1701,
    "VLM_BIN_37": 1702,
    "VLM_BIN_38": 1703,
    "VLM_BIN_39": 1704,
    "VLM_BIN_40": 1705,
    "VLM_BIN_41": 1706,
    "VLM_BIN_42": 1707,
    "VLM_BIN_43": 1708,
    "VLM_BIN_44": 1709,
    "VLM_BIN_45": 1710,
    "VLM_BIN_46": 1711,
    "VLM_BIN_47": 1712,
    "VLM_BIN_48": 1713,
    "VLM_BIN_49": 1714,
    "VLM_BIN_50": 1715,
    "VLM_BIN_51": 1716,
    "VLM_BIN_52": 1717,
    "VLM_BIN_53": 1718,
    "VLM_BIN_54": 1719,
    "VLM_BIN_55": 1720,
    "VLM_BIN_56": 1721,
    "VLM_BIN_57": 1722,
    "VLM_BIN_58": 1723,
    "VLM_BIN_59": 1724,
    "VLM_BIN_60": 1725,
    "VLM_BIN_61": 1726,
    "VLM_BIN_62": 1727,
    "VLM_BIN_63": 1728,
    "VLM_BIN_64": 1729,
    "VLM_BIN_65": 1730,
    "VLM_BIN_66": 1731,
    "VLM_BIN_67": 1732,
    "VLM_BIN_68": 1733,
    "VLM_BIN_69": 1734,
    "VLM_BIN_70": 1735,
    "VLM_BIN_71": 1736,
    "VLM_BIN_72": 1737,
    "VLM_BIN_73": 1738,
    "VLM_BIN_74": 1739,
    "VLM_BIN_75": 1740,
    "VLM_BIN_76": 1741,
    "VLM_BIN_77": 1742,
    "VLM_BIN_78": 1743,
    "VLM_BIN_79": 1744,
    "VLM_BIN_80": 1745,
    "VLM_BIN_81": 1746,
    "VLM_BIN_82": 1747,
    "VLM_BIN_83": 1748,
    "VLM_BIN_84": 1749,
    "VLM_BIN_85": 1750,
    "VLM_BIN_86": 1751,
    "VLM_BIN_87": 1752,
    "VLM_BIN_88": 1753,
    "VLM_BIN_89": 1754,
    "VLM_BIN_90": 1755,
    "VLM_BIN_91": 1756,
    "VLM_BIN_92": 1757,
    "VLM_BIN_93": 1758,
    "VLM_BIN_94": 1759,
    "VLM_BIN_95": 1760,
    "VLM_BIN_96": 1761,
    "VLM_BIN_97": 1762,
    "VLM_BIN_98": 1763,
    "VLM_BIN_99": 1764,
    "VLM_BIN_100": 1765,
    "VLM_BIN_101": 1766,
    "VLM_BIN_102": 1767,
    "VLM_BIN_103": 1768,
    "VLM_BIN_104": 1769,
    "VLM_BIN_105": 1770,
    "VLM_BIN_106": 1771,
    "VLM_BIN_107": 1772,
    "VLM_BIN_108": 1773,
    "VLM_BIN_109": 1774,
    "VLM_BIN_110": 1775,
    "VLM_BIN_111": 1776,
    "VLM_BIN_112": 1777,
    "VLM_BIN_113": 1778,
    "VLM_BIN_114": 1779,
    "VLM_BIN_115": 1780,
    "VLM_BIN_116": 1781,
    "VLM_BIN_117": 1782,
    "VLM_BIN_118": 1783,
    "VLM_BIN_119": 1784,
    "VLM_BIN_120": 1785,
    "VLM_BIN_121": 1786,
    "VLM_BIN_122": 1787,
    "VLM_BIN_123": 1788,
    "VLM_BIN_124": 1789,
    "VLM_BIN_125": 1790,
    "VLM_BIN_126": 1791,
    "VLM_BIN_127": 1792,
    "VLM_MISS": 1793,
    "VLM_OOR_LOW": 1794,
    "VLM_OOR_HIGH": 1795,
    "FLOW_BIN_0": 1796,
    "FLOW_BIN_1": 1797,
    "FLOW_BIN_2": 1798,
    "FLOW_BIN_3": 1799,
    "FLOW_BIN_4": 1800,
    "FLOW_BIN_5": 1801,
    "FLOW_BIN_6": 1802,
    "FLOW_BIN_7": 1803,
    "FLOW_BIN_8": 1804,
    "FLOW_BIN_9": 1805,
    "FLOW_BIN_10": 1806,
    "FLOW_BIN_11": 1807,
    "FLOW_BIN_12": 1808,
    "FLOW_BIN_13": 1809,
    "FLOW_BIN_14": 1810,
    "FLOW_BIN_15": 1811,
    "FLOW_BIN_16": 1812,
    "FLOW_BIN_17": 1813,
    "FLOW_BIN_18": 1814,
    "FLOW_BIN_19": 1815,
    "FLOW_BIN_20": 1816,
    "FLOW_BIN_21": 1817,
    "FLOW_BIN_22": 1818,
    "FLOW_BIN_23": 1819,
    "FLOW_BIN_24": 1820,
    "FLOW_BIN_25": 1821,
    "FLOW_BIN_26": 1822,
    "FLOW_BIN_27": 1823,
    "FLOW_BIN_28": 1824,
    "FLOW_BIN_29": 1825,
    "FLOW_BIN_30": 1826,
    "FLOW_BIN_31": 1827,
    "FLOW_BIN_32": 1828,
    "FLOW_BIN_33": 1829,
    "FLOW_BIN_34": 1830,
    "FLOW_BIN_35": 1831,
    "FLOW_BIN_36": 1832,
    "FLOW_BIN_37": 1833,
    "FLOW_BIN_38": 1834,
    "FLOW_BIN_39": 1835,
    "FLOW_BIN_40": 1836,
    "FLOW_BIN_41": 1837,
    "FLOW_BIN_42": 1838,
    "FLOW_BIN_43": 1839,
    "FLOW_BIN_44": 1840,
    "FLOW_BIN_45": 1841,
    "FLOW_BIN_46": 1842,
    "FLOW_BIN_47": 1843,
    "FLOW_BIN_48": 1844,
    "FLOW_BIN_49": 1845,
    "FLOW_BIN_50": 1846,
    "FLOW_BIN_51": 1847,
    "FLOW_BIN_52": 1848,
    "FLOW_BIN_53": 1849,
    "FLOW_BIN_54": 1850,
    "FLOW_BIN_55": 1851,
    "FLOW_BIN_56": 1852,
    "FLOW_BIN_57": 1853,
    "FLOW_BIN_58": 1854,
    "FLOW_BIN_59": 1855,
    "FLOW_BIN_60": 1856,
    "FLOW_BIN_61": 1857,
    "FLOW_BIN_62": 1858,
    "FLOW_BIN_63": 1859,
    "FLOW_BIN_64": 1860,
    "FLOW_BIN_65": 1861,
    "FLOW_BIN_66": 1862,
    "FLOW_BIN_67": 1863,
    "FLOW_BIN_68": 1864,
    "FLOW_BIN_69": 1865,
    "FLOW_BIN_70": 1866,
    "FLOW_BIN_71": 1867,
    "FLOW_BIN_72": 1868,
    "FLOW_BIN_73": 1869,
    "FLOW_BIN_74": 1870,
    "FLOW_BIN_75": 1871,
    "FLOW_BIN_76": 1872,
    "FLOW_BIN_77": 1873,
    "FLOW_BIN_78": 1874,
    "FLOW_BIN_79": 1875,
    "FLOW_BIN_80": 1876,
    "FLOW_BIN_81": 1877,
    "FLOW_BIN_82": 1878,
    "FLOW_BIN_83": 1879,
    "FLOW_BIN_84": 1880,
    "FLOW_BIN_85": 1881,
    "FLOW_BIN_86": 1882,
    "FLOW_BIN_87": 1883,
    "FLOW_BIN_88": 1884,
    "FLOW_BIN_89": 1885,
    "FLOW_BIN_90": 1886,
    "FLOW_BIN_91": 1887,
    "FLOW_BIN_92": 1888,
    "FLOW_BIN_93": 1889,
    "FLOW_BIN_94": 1890,
    "FLOW_BIN_95": 1891,
    "FLOW_BIN_96": 1892,
    "FLOW_BIN_97": 1893,
    "FLOW_BIN_98": 1894,
    "FLOW_BIN_99": 1895,
    "FLOW_BIN_100": 1896,
    "FLOW_BIN_101": 1897,
    "FLOW_BIN_102": 1898,
    "FLOW_BIN_103": 1899,
    "FLOW_BIN_104": 1900,
    "FLOW_BIN_105": 1901,
    "FLOW_BIN_106": 1902,
    "FLOW_BIN_107": 1903,
    "FLOW_BIN_108": 1904,
    "FLOW_BIN_109": 1905,
    "FLOW_BIN_110": 1906,
    "FLOW_BIN_111": 1907,
    "FLOW_BIN_112": 1908,
    "FLOW_BIN_113": 1909,
    "FLOW_BIN_114": 1910,
    "FLOW_BIN_115": 1911,
    "FLOW_BIN_116": 1912,
    "FLOW_BIN_117": 1913,
    "FLOW_BIN_118": 1914,
    "FLOW_BIN_119": 1915,
    "FLOW_BIN_120": 1916,
    "FLOW_BIN_121": 1917,
    "FLOW_BIN_122": 1918,
    "FLOW_BIN_123": 1919,
    "FLOW_BIN_124": 1920,
    "FLOW_BIN_125": 1921,
    "FLOW_BIN_126": 1922,
    "FLOW_BIN_127": 1923,
    "FLOW_MISS": 1924,
    "FLOW_OOR_LOW": 1925,
    "FLOW_OOR_HIGH": 1926,
    "SPREAD_BIN_0": 1927,
    "SPREAD_BIN_1": 1928,
    "SPREAD_BIN_2": 1929,
    "SPREAD_BIN_3": 1930,
    "SPREAD_BIN_4": 1931,
    "SPREAD_BIN_5": 1932,
    "SPREAD_BIN_6": 1933,
    "SPREAD_BIN_7": 1934,
    "SPREAD_BIN_8": 1935,
    "SPREAD_BIN_9": 1936,
    "SPREAD_BIN_10": 1937,
    "SPREAD_BIN_11": 1938,
    "SPREAD_BIN_12": 1939,
    "SPREAD_BIN_13": 1940,
    "SPREAD_BIN_14": 1941,
    "SPREAD_BIN_15": 1942,
    "SPREAD_BIN_16": 1943,
    "SPREAD_BIN_17": 1944,
    "SPREAD_BIN_18": 1945,
    "SPREAD_BIN_19": 1946,
    "SPREAD_BIN_20": 1947,
    "SPREAD_BIN_21": 1948,
    "SPREAD_BIN_22": 1949,
    "SPREAD_BIN_23": 1950,
    "SPREAD_BIN_24": 1951,
    "SPREAD_BIN_25": 1952,
    "SPREAD_BIN_26": 1953,
    "SPREAD_BIN_27": 1954,
    "SPREAD_BIN_28": 1955,
    "SPREAD_BIN_29": 1956,
    "SPREAD_BIN_30": 1957,
    "SPREAD_BIN_31": 1958,
    "SPREAD_BIN_32": 1959,
    "SPREAD_BIN_33": 1960,
    "SPREAD_BIN_34": 1961,
    "SPREAD_BIN_35": 1962,
    "SPREAD_BIN_36": 1963,
    "SPREAD_BIN_37": 1964,
    "SPREAD_BIN_38": 1965,
    "SPREAD_BIN_39": 1966,
    "SPREAD_BIN_40": 1967,
    "SPREAD_BIN_41": 1968,
    "SPREAD_BIN_42": 1969,
    "SPREAD_BIN_43": 1970,
    "SPREAD_BIN_44": 1971,
    "SPREAD_BIN_45": 1972,
    "SPREAD_BIN_46": 1973,
    "SPREAD_BIN_47": 1974,
    "SPREAD_BIN_48": 1975,
    "SPREAD_BIN_49": 1976,
    "SPREAD_BIN_50": 1977,
    "SPREAD_BIN_51": 1978,
    "SPREAD_BIN_52": 1979,
    "SPREAD_BIN_53": 1980,
    "SPREAD_BIN_54": 1981,
    "SPREAD_BIN_55": 1982,
    "SPREAD_BIN_56": 1983,
    "SPREAD_BIN_57": 1984,
    "SPREAD_BIN_58": 1985,
    "SPREAD_BIN_59": 1986,
    "SPREAD_BIN_60": 1987,
    "SPREAD_BIN_61": 1988,
    "SPREAD_BIN_62": 1989,
    "SPREAD_BIN_63": 1990,
    "SPREAD_BIN_64": 1991,
    "SPREAD_BIN_65": 1992,
    "SPREAD_BIN_66": 1993,
    "SPREAD_BIN_67": 1994,
    "SPREAD_BIN_68": 1995,
    "SPREAD_BIN_69": 1996,
    "SPREAD_BIN_70": 1997,
    "SPREAD_BIN_71": 1998,
    "SPREAD_BIN_72": 1999,
    "SPREAD_BIN_73": 2000,
    "SPREAD_BIN_74": 2001,
    "SPREAD_BIN_75": 2002,
    "SPREAD_BIN_76": 2003,
    "SPREAD_BIN_77": 2004,
    "SPREAD_BIN_78": 2005,
    "SPREAD_BIN_79": 2006,
    "SPREAD_BIN_80": 2007,
    "SPREAD_BIN_81": 2008,
    "SPREAD_BIN_82": 2009,
    "SPREAD_BIN_83": 2010,
    "SPREAD_BIN_84": 2011,
    "SPREAD_BIN_85": 2012,
    "SPREAD_BIN_86": 2013,
    "SPREAD_BIN_87": 2014,
    "SPREAD_BIN_88": 2015,
    "SPREAD_BIN_89": 2016,
    "SPREAD_BIN_90": 2017,
    "SPREAD_BIN_91": 2018,
    "SPREAD_BIN_92": 2019,
    "SPREAD_BIN_93": 2020,
    "SPREAD_BIN_94": 2021,
    "SPREAD_BIN_95": 2022,
    "SPREAD_MISS": 2023,
    "SPREAD_OOR_LOW": 2024,
    "SPREAD_OOR_HIGH": 2025,
    "OI_BIN_0": 2026,
    "OI_BIN_1": 2027,
    "OI_BIN_2": 2028,
    "OI_BIN_3": 2029,
    "OI_BIN_4": 2030,
    "OI_BIN_5": 2031,
    "OI_BIN_6": 2032,
    "OI_BIN_7": 2033,
    "OI_BIN_8": 2034,
    "OI_BIN_9": 2035,
    "OI_BIN_10": 2036,
    "OI_BIN_11": 2037,
    "OI_BIN_12": 2038,
    "OI_BIN_13": 2039,
    "OI_BIN_14": 2040,
    "OI_BIN_15": 2041,
    "OI_BIN_16": 2042,
    "OI_BIN_17": 2043,
    "OI_BIN_18": 2044,
    "OI_BIN_19": 2045,
    "OI_BIN_20": 2046,
    "OI_BIN_21": 2047,
    "OI_BIN_22": 2048,
    "OI_BIN_23": 2049,
    "OI_BIN_24": 2050,
    "OI_BIN_25": 2051,
    "OI_BIN_26": 2052,
    "OI_BIN_27": 2053,
    "OI_BIN_28": 2054,
    "OI_BIN_29": 2055,
    "OI_BIN_30": 2056,
    "OI_BIN_31": 2057,
    "OI_BIN_32": 2058,
    "OI_BIN_33": 2059,
    "OI_BIN_34": 2060,
    "OI_BIN_35": 2061,
    "OI_BIN_36": 2062,
    "OI_BIN_37": 2063,
    "OI_BIN_38": 2064,
    "OI_BIN_39": 2065,
    "OI_BIN_40": 2066,
    "OI_BIN_41": 2067,
    "OI_BIN_42": 2068,
    "OI_BIN_43": 2069,
    "OI_BIN_44": 2070,
    "OI_BIN_45": 2071,
    "OI_BIN_46": 2072,
    "OI_BIN_47": 2073,
    "OI_BIN_48": 2074,
    "OI_BIN_49": 2075,
    "OI_BIN_50": 2076,
    "OI_BIN_51": 2077,
    "OI_BIN_52": 2078,
    "OI_BIN_53": 2079,
    "OI_BIN_54": 2080,
    "OI_BIN_55": 2081,
    "OI_BIN_56": 2082,
    "OI_BIN_57": 2083,
    "OI_BIN_58": 2084,
    "OI_BIN_59": 2085,
    "OI_BIN_60": 2086,
    "OI_BIN_61": 2087,
    "OI_BIN_62": 2088,
    "OI_BIN_63": 2089,
    "OI_BIN_64": 2090,
    "OI_BIN_65": 2091,
    "OI_BIN_66": 2092,
    "OI_BIN_67": 2093,
    "OI_BIN_68": 2094,
    "OI_BIN_69": 2095,
    "OI_BIN_70": 2096,
    "OI_BIN_71": 2097,
    "OI_BIN_72": 2098,
    "OI_BIN_73": 2099,
    "OI_BIN_74": 2100,
    "OI_BIN_75": 2101,
    "OI_BIN_76": 2102,
    "OI_BIN_77": 2103,
    "OI_BIN_78": 2104,
    "OI_BIN_79": 2105,
    "OI_BIN_80": 2106,
    "OI_BIN_81": 2107,
    "OI_BIN_82": 2108,
    "OI_BIN_83": 2109,
    "OI_BIN_84": 2110,
    "OI_BIN_85": 2111,
    "OI_BIN_86": 2112,
    "OI_BIN_87": 2113,
    "OI_BIN_88": 2114,
    "OI_BIN_89": 2115,
    "OI_BIN_90": 2116,
    "OI_BIN_91": 2117,
    "OI_BIN_92": 2118,
    "OI_BIN_93": 2119,
    "OI_BIN_94": 2120,
    "OI_BIN_95": 2121,
    "OI_BIN_96": 2122,
    "OI_BIN_97": 2123,
    "OI_BIN_98": 2124,
    "OI_BIN_99": 2125,
    "OI_BIN_100": 2126,
    "OI_BIN_101": 2127,
    "OI_BIN_102": 2128,
    "OI_BIN_103": 2129,
    "OI_BIN_104": 2130,
    "OI_BIN_105": 2131,
    "OI_BIN_106": 2132,
    "OI_BIN_107": 2133,
    "OI_BIN_108": 2134,
    "OI_BIN_109": 2135,
    "OI_BIN_110": 2136,
    "OI_BIN_111": 2137,
    "OI_BIN_112": 2138,
    "OI_BIN_113": 2139,
    "OI_BIN_114": 2140,
    "OI_BIN_115": 2141,
    "OI_BIN_116": 2142,
    "OI_BIN_117": 2143,
    "OI_BIN_118": 2144,
    "OI_BIN_119": 2145,
    "OI_BIN_120": 2146,
    "OI_BIN_121": 2147,
    "OI_BIN_122": 2148,
    "OI_BIN_123": 2149,
    "OI_BIN_124": 2150,
    "OI_BIN_125": 2151,
    "OI_BIN_126": 2152,
    "OI_BIN_127": 2153,
    "OI_MISS": 2154,
    "OI_OOR_LOW": 2155,
    "OI_OOR_HIGH": 2156,
    "FUND_BIN_0": 2157,
    "FUND_BIN_1": 2158,
    "FUND_BIN_2": 2159,
    "FUND_BIN_3": 2160,
    "FUND_BIN_4": 2161,
    "FUND_BIN_5": 2162,
    "FUND_BIN_6": 2163,
    "FUND_BIN_7": 2164,
    "FUND_BIN_8": 2165,
    "FUND_BIN_9": 2166,
    "FUND_BIN_10": 2167,
    "FUND_BIN_11": 2168,
    "FUND_BIN_12": 2169,
    "FUND_BIN_13": 2170,
    "FUND_BIN_14": 2171,
    "FUND_BIN_15": 2172,
    "FUND_BIN_16": 2173,
    "FUND_BIN_17": 2174,
    "FUND_BIN_18": 2175,
    "FUND_BIN_19": 2176,
    "FUND_BIN_20": 2177,
    "FUND_BIN_21": 2178,
    "FUND_BIN_22": 2179,
    "FUND_BIN_23": 2180,
    "FUND_BIN_24": 2181,
    "FUND_BIN_25": 2182,
    "FUND_BIN_26": 2183,
    "FUND_BIN_27": 2184,
    "FUND_BIN_28": 2185,
    "FUND_BIN_29": 2186,
    "FUND_BIN_30": 2187,
    "FUND_BIN_31": 2188,
    "FUND_BIN_32": 2189,
    "FUND_BIN_33": 2190,
    "FUND_BIN_34": 2191,
    "FUND_BIN_35": 2192,
    "FUND_BIN_36": 2193,
    "FUND_BIN_37": 2194,
    "FUND_BIN_38": 2195,
    "FUND_BIN_39": 2196,
    "FUND_BIN_40": 2197,
    "FUND_BIN_41": 2198,
    "FUND_BIN_42": 2199,
    "FUND_BIN_43": 2200,
    "FUND_BIN_44": 2201,
    "FUND_BIN_45": 2202,
    "FUND_BIN_46": 2203,
    "FUND_BIN_47": 2204,
    "FUND_BIN_48": 2205,
    "FUND_BIN_49": 2206,
    "FUND_BIN_50": 2207,
    "FUND_BIN_51": 2208,
    "FUND_BIN_52": 2209,
    "FUND_BIN_53": 2210,
    "FUND_BIN_54": 2211,
    "FUND_BIN_55": 2212,
    "FUND_BIN_56": 2213,
    "FUND_BIN_57": 2214,
    "FUND_BIN_58": 2215,
    "FUND_BIN_59": 2216,
    "FUND_BIN_60": 2217,
    "FUND_BIN_61": 2218,
    "FUND_BIN_62": 2219,
    "FUND_BIN_63": 2220,
    "FUND_BIN_64": 2221,
    "FUND_BIN_65": 2222,
    "FUND_BIN_66": 2223,
    "FUND_BIN_67": 2224,
    "FUND_BIN_68": 2225,
    "FUND_BIN_69": 2226,
    "FUND_BIN_70": 2227,
    "FUND_BIN_71": 2228,
    "FUND_BIN_72": 2229,
    "FUND_BIN_73": 2230,
    "FUND_BIN_74": 2231,
    "FUND_BIN_75": 2232,
    "FUND_BIN_76": 2233,
    "FUND_BIN_77": 2234,
    "FUND_BIN_78": 2235,
    "FUND_BIN_79": 2236,
    "FUND_BIN_80": 2237,
    "FUND_BIN_81": 2238,
    "FUND_BIN_82": 2239,
    "FUND_BIN_83": 2240,
    "FUND_BIN_84": 2241,
    "FUND_BIN_85": 2242,
    "FUND_BIN_86": 2243,
    "FUND_BIN_87": 2244,
    "FUND_BIN_88": 2245,
    "FUND_BIN_89": 2246,
    "FUND_BIN_90": 2247,
    "FUND_BIN_91": 2248,
    "FUND_BIN_92": 2249,
    "FUND_BIN_93": 2250,
    "FUND_BIN_94": 2251,
    "FUND_BIN_95": 2252,
    "FUND_BIN_96": 2253,
    "FUND_BIN_97": 2254,
    "FUND_BIN_98": 2255,
    "FUND_BIN_99": 2256,
    "FUND_BIN_100": 2257,
    "FUND_BIN_101": 2258,
    "FUND_BIN_102": 2259,
    "FUND_BIN_103": 2260,
    "FUND_BIN_104": 2261,
    "FUND_BIN_105": 2262,
    "FUND_BIN_106": 2263,
    "FUND_BIN_107": 2264,
    "FUND_BIN_108": 2265,
    "FUND_BIN_109": 2266,
    "FUND_BIN_110": 2267,
    "FUND_BIN_111": 2268,
    "FUND_BIN_112": 2269,
    "FUND_BIN_113": 2270,
    "FUND_BIN_114": 2271,
    "FUND_BIN_115": 2272,
    "FUND_BIN_116": 2273,
    "FUND_BIN_117": 2274,
    "FUND_BIN_118": 2275,
    "FUND_BIN_119": 2276,
    "FUND_BIN_120": 2277,
    "FUND_BIN_121": 2278,
    "FUND_BIN_122": 2279,
    "FUND_BIN_123": 2280,
    "FUND_BIN_124": 2281,
    "FUND_BIN_125": 2282,
    "FUND_BIN_126": 2283,
    "FUND_BIN_127": 2284,
    "FUND_MISS": 2285,
    "FUND_OOR_LOW": 2286,
    "FUND_OOR_HIGH": 2287,
    "BASIS_BIN_0": 2288,
    "BASIS_BIN_1": 2289,
    "BASIS_BIN_2": 2290,
    "BASIS_BIN_3": 2291,
    "BASIS_BIN_4": 2292,
    "BASIS_BIN_5": 2293,
    "BASIS_BIN_6": 2294,
    "BASIS_BIN_7": 2295,
    "BASIS_BIN_8": 2296,
    "BASIS_BIN_9": 2297,
    "BASIS_BIN_10": 2298,
    "BASIS_BIN_11": 2299,
    "BASIS_BIN_12": 2300,
    "BASIS_BIN_13": 2301,
    "BASIS_BIN_14": 2302,
    "BASIS_BIN_15": 2303,
    "BASIS_BIN_16": 2304,
    "BASIS_BIN_17": 2305,
    "BASIS_BIN_18": 2306,
    "BASIS_BIN_19": 2307,
    "BASIS_BIN_20": 2308,
    "BASIS_BIN_21": 2309,
    "BASIS_BIN_22": 2310,
    "BASIS_BIN_23": 2311,
    "BASIS_BIN_24": 2312,
    "BASIS_BIN_25": 2313,
    "BASIS_BIN_26": 2314,
    "BASIS_BIN_27": 2315,
    "BASIS_BIN_28": 2316,
    "BASIS_BIN_29": 2317,
    "BASIS_BIN_30": 2318,
    "BASIS_BIN_31": 2319,
    "BASIS_BIN_32": 2320,
    "BASIS_BIN_33": 2321,
    "BASIS_BIN_34": 2322,
    "BASIS_BIN_35": 2323,
    "BASIS_BIN_36": 2324,
    "BASIS_BIN_37": 2325,
    "BASIS_BIN_38": 2326,
    "BASIS_BIN_39": 2327,
    "BASIS_BIN_40": 2328,
    "BASIS_BIN_41": 2329,
    "BASIS_BIN_42": 2330,
    "BASIS_BIN_43": 2331,
    "BASIS_BIN_44": 2332,
    "BASIS_BIN_45": 2333,
    "BASIS_BIN_46": 2334,
    "BASIS_BIN_47": 2335,
    "BASIS_BIN_48": 2336,
    "BASIS_BIN_49": 2337,
    "BASIS_BIN_50": 2338,
    "BASIS_BIN_51": 2339,
    "BASIS_BIN_52": 2340,
    "BASIS_BIN_53": 2341,
    "BASIS_BIN_54": 2342,
    "BASIS_BIN_55": 2343,
    "BASIS_BIN_56": 2344,
    "BASIS_BIN_57": 2345,
    "BASIS_BIN_58": 2346,
    "BASIS_BIN_59": 2347,
    "BASIS_BIN_60": 2348,
    "BASIS_BIN_61": 2349,
    "BASIS_BIN_62": 2350,
    "BASIS_BIN_63": 2351,
    "BASIS_BIN_64": 2352,
    "BASIS_BIN_65": 2353,
    "BASIS_BIN_66": 2354,
    "BASIS_BIN_67": 2355,
    "BASIS_BIN_68": 2356,
    "BASIS_BIN_69": 2357,
    "BASIS_BIN_70": 2358,
    "BASIS_BIN_71": 2359,
    "BASIS_BIN_72": 2360,
    "BASIS_BIN_73": 2361,
    "BASIS_BIN_74": 2362,
    "BASIS_BIN_75": 2363,
    "BASIS_BIN_76": 2364,
    "BASIS_BIN_77": 2365,
    "BASIS_BIN_78": 2366,
    "BASIS_BIN_79": 2367,
    "BASIS_BIN_80": 2368,
    "BASIS_BIN_81": 2369,
    "BASIS_BIN_82": 2370,
    "BASIS_BIN_83": 2371,
    "BASIS_BIN_84": 2372,
    "BASIS_BIN_85": 2373,
    "BASIS_BIN_86": 2374,
    "BASIS_BIN_87": 2375,
    "BASIS_BIN_88": 2376,
    "BASIS_BIN_89": 2377,
    "BASIS_BIN_90": 2378,
    "BASIS_BIN_91": 2379,
    "BASIS_BIN_92": 2380,
    "BASIS_BIN_93": 2381,
    "BASIS_BIN_94": 2382,
    "BASIS_BIN_95": 2383,
    "BASIS_BIN_96": 2384,
    "BASIS_BIN_97": 2385,
    "BASIS_BIN_98": 2386,
    "BASIS_BIN_99": 2387,
    "BASIS_BIN_100": 2388,
    "BASIS_BIN_101": 2389,
    "BASIS_BIN_102": 2390,
    "BASIS_BIN_103": 2391,
    "BASIS_BIN_104": 2392,
    "BASIS_BIN_105": 2393,
    "BASIS_BIN_106": 2394,
    "BASIS_BIN_107": 2395,
    "BASIS_BIN_108": 2396,
    "BASIS_BIN_109": 2397,
    "BASIS_BIN_110": 2398,
    "BASIS_BIN_111": 2399,
    "BASIS_BIN_112": 2400,
    "BASIS_BIN_113": 2401,
    "BASIS_BIN_114": 2402,
    "BASIS_BIN_115": 2403,
    "BASIS_BIN_116": 2404,
    "BASIS_BIN_117": 2405,
    "BASIS_BIN_118": 2406,
    "BASIS_BIN_119": 2407,
    "BASIS_BIN_120": 2408,
    "BASIS_BIN_121": 2409,
    "BASIS_BIN_122": 2410,
    "BASIS_BIN_123": 2411,
    "BASIS_BIN_124": 2412,
    "BASIS_BIN_125": 2413,
    "BASIS_BIN_126": 2414,
    "BASIS_BIN_127": 2415,
    "BASIS_MISS": 2416,
    "BASIS_OOR_LOW": 2417,
    "BASIS_OOR_HIGH": 2418,
    "EVENT_TYPE_VOL_SPIKE": 2419,
    "EVENT_TYPE_VOL_COMPRESSION": 2420,
    "EVENT_TYPE_BREAKOUT": 2421,
    "EVENT_TYPE_FAKE_BREAKOUT": 2422,
    "EVENT_TYPE_GAP_MOVE": 2423,
    "EVENT_TYPE_LIQUIDITY_DROP": 2424,
    "EVENT_TYPE_FUNDING_SPIKE": 2425,
    "EVENT_TYPE_OI_SURGE": 2426,
    "EVENT_TYPE_OI_FLUSH": 2427,
    "EVENT_TYPE_LIQUIDATION_CLUSTER": 2428,
    "EVENT_TYPE_MACRO_RELEASE": 2429,
    "EVENT_TYPE_POLICY_SIGNAL": 2430,
    "EVENT_TYPE_NEWS_SENTIMENT": 2431,
    "EVENT_TYPE_RISK_OFF_FLAG": 2432,
    "EVENT_TYPE_VOL_INDEX_SHOCK": 2433,
    "EVENT_DIR_UP": 2434,
    "EVENT_DIR_DOWN": 2435,
    "EVENT_DIR_NEUTRAL": 2436,
    "EVENT_DIR_MISS": 2437,
    "EVENT_MAG_LOW": 2438,
    "EVENT_MAG_MEDIUM": 2439,
    "EVENT_MAG_HIGH": 2440,
    "EVENT_MAG_EXTREME": 2441,
    "EVENT_MAG_MISS": 2442,
    "EVENT_DUR_INTRABAR": 2443,
    "EVENT_DUR_SHORT": 2444,
    "EVENT_DUR_MEDIUM": 2445,
    "EVENT_DUR_LONG": 2446,
    "EVENT_DUR_MISS": 2447,
    "EVENT_CONF_WEAK": 2448,
    "EVENT_CONF_MODERATE": 2449,
    "EVENT_CONF_STRONG": 2450,
    "EVENT_CONF_MISS": 2451,
    "EVENT_SURP_NEG": 2452,
    "EVENT_SURP_NEUTRAL": 2453,
    "EVENT_SURP_POS": 2454,
    "EVENT_SURP_MISS": 2455,
    "EVENT_SRC_MARKET": 2456,
    "EVENT_SRC_DERIV": 2457,
    "EVENT_SRC_MACRO": 2458,
    "EVENT_SRC_RISK": 2459,
    "EVENT_SRC_MISS": 2460
  }
}